{
	"status": "prototype",
	"context": {
		"date": "2017-04-06",
		"author": "Fredrik Larsson",
		"heading": "Andy and the<br />spc testfile<br />component",
		"ingress": "This is the spc testfile component. If the JavaScript is properly transfered into your project the \"Andy ...\" heading above should be fully responsive, and also you should find a message from the testfile in the console. The image below, if everything wen't well, should be Mr.Andy staring right at you.",
		"content": "<h2>SPC is short for Spacecraft</h2><p>And Spacecraft is a tool for building websites in which you are in control- of and can work based on components. When working with this method, wouldn't it be quite handy to be able to reuse and develop these components between projects? I am now working with a project with the aim to find- and implement a way to distribute and versioncontrol components.</p><p>To use Spacecraft together with the ready-to-use components, start with cloning this repo: <a href=\"https://github.com/pedric/spacecraft-starterkit\">https://github.com/pedric/spacecraft-starterkit</a>, which is a version of Spacecraft-Starter in where another customised version of Spacecraft lives. This kit are expanded with the tasks for importing components direct to your project with a few commands.</p><h3>Quick start guide</h3><p>Clone/download the repo above, then...<pre>npm install</pre>...and to get this actual component downloaded run...<pre>npm install --save spc_testfile</pre> ...followed by this to get the files into your project...<pre>gulp import --component spc_testfile</pre> ...and to start up Spacecraft you just use...<pre>gulp</pre>The last step is to import the scss, in... <pre>./src/scss/components/_components.main.scss</pre> ...add... <pre>@import \"views/spc_testfile/spc_testfile\";</pre></p><h3>spc_testfile</h3><p>There is no limitation to what a component is, this for example, could easily being a template beased on different smaller components but as is now it is a component which contains an article. If wrapping this in a head-, header- and footer component would be an example of a complete page-template based on four components. But in first hand the spc_testfile is to test and develop the structure, conventions, distribution etc for a component. If you look at <a href=\"https://github.com/pedric/spc_testfile\">this repo</a> or open the folder <i>/spacecraft_starterkit /node_modules /spc_testfile</i> after the quick start guide you will find a structure which is a suggestion of how to structure components. This match well with how the different filetypes are handled in Spacecraft after importing them.</p><ul><li>index.js</li><li>package.json</li><li>docs/</li><li>icons/</li><li>img/</li><li>js/</li><li>view/</li><li>changelog.md</li><li>readme.md</li><li>license.txt</li></ul><h3>The copy/paste</h3><p>Somewhere you will do the \"copy/paste\", sure you can be developing your component directly and push it to NPM/GIT, but probably you will enhance components while working on them in different projects. In the structure as it is built now you will have to do this \"copy/paste\" since the import process is copying components into a project and from there one are not working with the original version.</p><h3>Using this component</h3><p>Follow the quick start guide and then customize it as you feel fits your project, this content is imported from the spc_testfile.config.json file in the ./view folder.</p><h3>Sources</h3><ul><li><a href=\"https://github.com/pedric/spacecraft-starterkit\"><strong>Spacecraft-starterkit</strong></a></li><li><a href=\"https://github.com/pedric/spacecraft-projectversion\"><strong>Spacecraft Module (customised project version)</strong></a></li><li><a href=\"https://spc-component-library.herokuapp.com/index.html\"><strong>Browse the Component Library</strong></a></li><li><a href=\"https://github.com/pedric/spc_component_library\"><strong>The Component Library at github</strong></a></li><li><a href=\"https://github.com/pedric/spc_testfile\"><strong>Spc_testfile at github</strong></a></li><li><a href=\"https://www.npmjs.com/package/spc_testfile\"><strong>Spc_testfile at NPM</strong></a></li></ul>",
		"image": {
			"url": "/img/spc_testfile.jpg",
			"alt": "Placeholder image for the spc testfile component.",
			"copyright": "Andy Warhol",
			"description" : "Oh look at Mr.Warhol just standing there being a perfect placeholder."
		},
		"icons": {
			"twitter": {
				"name": "spc_testfile_twitter",
				"target": "#"
			},
			"instagram": {
				"name": "spc_testfile_instagram",
				"target": "#"
			},
			"facebook": {
				"name": "spc_testfile_facebook",
				"target": "#"
			}

		}
	}
}