{
	"status": "prototype",
	"context": {
		"date": "2017-04-06",
		"author": "Fredrik Larsson",
		"heading": "Andy and the<br />spc testfile<br />component",
		"ingress": "This is the spc testfile component. If the JavaScript is properly transfered into your project the \"Andy Dandy\" heading above should be fully responsive, and also you should find a confirmation in the console. The image below, if everything wen't well, should be Mr.Andy staring right at you.",
		"content": "<h2>SPC is short for Spacecraft</h2><p>Nulla consequat massa quis enim. Donec pede justo, fringilla vel, aliquet nec, vulputate eget, arcu. In enim justo, rhoncus ut, imperdiet a, venenatis vitae, justo. Nullam dictum felis eu pede mollis pretium. Integer tincidunt. Cras dapibus. Vivamus elementum semper nisi. Aenean vulputate eleifend tellus. Aenean leo ligula, porttitor eu, consequat vitae, eleifend ac, enim. Aliquam lorem ante, dapibus in, viverra quis, feugiat a, tellus. Phasellus viverra nulla ut metus varius laoreet. Quisque rutrum. Aenean imperdiet. Etiam ultricies nisi vel augue.</p><p>Nulla consequat massa quis enim. Donec pede justo, fringilla vel, aliquet nec, vulputate eget, arcu. In enim justo, rhoncus ut, imperdiet a, venenatis vitae, justo. Nullam dictum felis eu pede mollis pretium. Integer tincidunt. Cras dapibus. Vivamus elementum semper nisi. Aenean vulputate eleifend tellus. Aenean leo ligula, porttitor eu, consequat vitae, eleifend ac, enim. Aliquam lorem ante, dapibus in, viverra quis, feugiat a, tellus. Phasellus viverra nulla ut metus varius laoreet. Quisque rutrum. Aenean imperdiet. Etiam ultricies nisi vel augue. Nulla consequat massa quis enim. Donec pede justo, fringilla vel, aliquet nec, vulputate eget, arcu. In enim justo, rhoncus ut, imperdiet a, venenatis vitae, justo. Nullam dictum felis eu pede mollis pretium. Integer tincidunt. Cras dapibus. Vivamus elementum semper nisi. Aenean vulputate eleifend tellus. Aenean leo ligula, porttitor eu, consequat vitae, eleifend ac, enim. Aliquam lorem ante, dapibus in, viverra quis, feugiat a, tellus. Phasellus viverra nulla ut metus varius laoreet. Quisque rutrum. Aenean imperdiet. Etiam ultricies nisi vel augue.</p>",
		"image": {
			"url": "/img/spc_testfile.jpg",
			"alt": "Placeholder image for the spc testfile component.",
			"copyright": "Andy Warhol",
			"description" : "Oh look at Mr.Warhol just standing there being a perfect placeholder."
		},
		"icons": {
			"twitter": {
				"name": "spc_testfile_twitter",
				"target": "#"
			},
			"instagram": {
				"name": "spc_testfile_instagram",
				"target": "#"
			},
			"facebook": {
				"name": "spc_testfile_facebook",
				"target": "#"
			}

		}
	}
}